/* ------------------------------------------------------------------------- */
/* UltraSonicSensor.cpp														 */
/* 超音波センサから距離をcm単位で取得する									 */
/* シングルトンで定義														 */
/* ------------------------------------------------------------------------- */
/* 番号	更新履歴								日付		   氏名			 */
/* ------------------------------------------------------------------------- */
/* 000000	新規作成							2022/07/14     筈尾　辰也	 */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* Include																	 */
/* ------------------------------------------------------------------------- */
#include "UltraSonicSensor.h"

/* ------------------------------------------------------------------------- */
/* 関数名	: UltraSonicSensor::UltraSonicSensor							 */
/* 機能名	: コンストラクタ												 */
/* 機能概要	: インスタンス作成は getInstance() で行う、変数の初期化等を担当	 */
/* 引数		: なし															 */
/* 戻り値	: void															 */
/* 作成日	: 2022/07/14		筈尾  辰也		新規作成					 */
/* ------------------------------------------------------------------------- */
UltraSonicSensor::UltraSonicSensor(void)
{}
/* ------------------------------------------------------------------------- */
/* 関数名	: UltraSonicSensor::~UltraSonicSensor							 */
/* 機能名	: デストラクタ													 */
/* 機能概要	: DM開放やインスタンスのポインターNULL化を担当					 */
/* 引数		: なし															 */
/* 戻り値	: void															 */
/* 作成日	: 2022/07/14		筈尾  辰也		新規作成					 */
/* ------------------------------------------------------------------------- */
UltraSonicSensor::~UltraSonicSensor(void)
{}
/* ------------------------------------------------------------------------- */
/* 関数名	: UltraSonicSensor::init										 */
/* 機能名	: センサのport設定の初期化										 */
/* 機能概要	: センサの初期化(ポート設定)を行う								 */
/* 引数		: なし															 */
/* 戻り値	: int8_t				:SYS_OK			:正常終了				 */
/*			: int8_t				:SYS_NG			:異常終了				 */
/* 作成日	: 2022/07/14		筈尾  辰也		新規作成					 */
/* ------------------------------------------------------------------------- */
int8_t UltraSonicSensor::init( void ){

	
	ER errorCheck = NULL;						/* エラーチェック変数		 */

	/* エラーチェック */
	errorCheck = ev3_sensor_config( EV3_PORT_3 ,ULTRASONIC_SENSOR );

	/* 正常ならOK、異常ならNGを返す */
	if( errorCheck != E_OK ){
		printf( "超音波センサのportが正常ではありません\n" );
		return SYS_NG;
	}
	return SYS_OK;
}

/* ------------------------------------------------------------------------- */
/* 関数名	: UltraSonicSensor::getDistance									 */
/* 機能名	: 障害物との距離をCM単位で取得する								 */
/* 機能概要	: APIを呼び出して距離情報を取得									 */
/* 引数		: なし															 */
/* 戻り値	: int16_t			:distance			:距離(cm単位)			 */
/* 作成日	: 2022/07/14		筈尾  辰也		新規作成					 */
/* ------------------------------------------------------------------------- */
uint16_t UltraSonicSensor::getDistance( void ) {

	int16_t distance;							/* 距離変数					 */

	/* 距離の取得 */
	distance = ev3_ultrasonic_sensor_get_distance(EV3_PORT_3);

	/* 距離を返す */
	return distance;
}